## Extraire STR -> num

In [13]:
import pandas as pd
fp = "https://bit.ly/bitcoin-purchases"
df = pd.read_csv(fp)
df.head()

                      bitcoin address wire amount          credit card
0  1HeUNvQfhjn8afvjMrMEX5VQB5zy8AacXZ    $2268.82  6759241310493014168
1  18xA8uEzQsEQpyfJWrrLmnu72ut7p2GgeU    $4590.27     6394078189900621
2  1CPLebXd6VKdEmD6xsVByYDbsyhkZ4XzrE    $6160.48     3539006321388994
3  1ESn9zPPwAExS98jqhjkDPd7tGeoevL42u    $6647.19     3560801557252993
4  1JLYsDExCUsEPrN6vNsEgJubJE4xqWtqhp    $3759.40     5349906235596126

In [14]:
df.dtypes

bitcoin address    object
wire amount        object
credit card         int64
dtype: object

In [15]:
df.isna().sum()

bitcoin address    0
wire amount        0
credit card        0
dtype: int64

In [17]:
df['wire amount'] = df['wire amount'].str.replace('$', '').astype('float'); df.dtypes

bitcoin address     object
wire amount        float64
credit card          int64
dtype: object

### Extraire la devise et nettoyer

In [47]:
fp = "https://bit.ly/bitcoin-purchases2"
df = pd.read_csv(fp)
df.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311,06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032,44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

In [48]:
df['devise'] = df['wire amount'].str[0]

In [49]:
df['wire amount'] = df['wire amount'].str[1:].str.replace(',', '.').astype('float'); df.dtypes

bitcoin address     object
wire amount        float64
credit card          int64
devise              object
dtype: object

In [50]:
df.head()

                      bitcoin address  wire amount       credit card devise
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe      8356.92  3543456448666398      £
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q       311.06  3584615208479876      €
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP      2032.44  6370577480710876      €
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6      8155.74  4508652385157398      ¥
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ      3265.44   374622922103592      £

### Exo 1

In [60]:
import random

def makeNumberStr(sep=[',']):
    avantV = str(random.randint(1, 1000))
    apresV = '{:02}'.format(random.randint(0, 99))
    sep = random.choice(sep)
    return avantV + sep + apresV

col1 = [makeNumberStr() for i in range(200)]
col2 = [makeNumberStr(['.', ',']) for i in range(200)]

exo1 = pd.DataFrame(data={"col1": col1, "col2": col2}); exo1

       col1    col2
0    838,25  299,69
1    717,64  694,64
2    932,48  583.43
3    488,10  676,34
4    347,40  179.96
..      ...     ...
195  140,42  337,77
196  862,64  133,48
197  156,26  550.53
198  391,69  268,04
199  112,48  923.83

[200 rows x 2 columns]

In [61]:
exo1['col2'] = exo1['col2'].str.replace(',', '.').astype('float'); exo1.dtypes

col1     object
col2    float64
dtype: object

### Exo 2

In [64]:
import random

def makeNumberStrSign(sep=[','], signs=['€','$']):
    avantV = str(random.randint(1, 1000))
    apresV = '{:02}'.format(random.randint(0, 99))
    sep = random.choice(sep)
    sign = random.choice(signs)
    return avantV + sep + apresV + sign

col1 = [makeNumberStrSign() for i in range(200)]
col2 = [makeNumberStrSign(['.', ',']) for i in range(200)]

exo2 = pd.DataFrame(data={"col1": col1, "col2": col2}) ; exo2

        col1     col2
0    773,67$  579,00€
1    989,47$  701,34€
2    102,37€  339,20€
3    548,80€  542.92€
4    981,50€   71.25€
..       ...      ...
195  156,90$  283,77$
196  165,70€  286,30€
197  745,69€  272,67$
198  908,97$  707.69€
199  767,95$  655.65$

[200 rows x 2 columns]

In [66]:
def unifyCol(col):
    return col.str[:-1].str.replace(',', '.')

exo2['col1'] = unifyCol(exo2['col1'])
exo2['col2'] = unifyCol(exo2['col2'])

exo2

      col1   col2
0    773.6  579.0
1    989.4  701.3
2    102.3  339.2
3    548.8  542.9
4    981.5   71.2
..     ...    ...
195  156.9  283.7
196  165.7  286.3
197  745.6  272.6
198  908.9  707.6
199  767.9  655.6

[200 rows x 2 columns]